---
kind: property
id: P:Autodesk.Revit.DB.LinkConversionData.ServerId
source: html/3b81a9f7-f72c-12f2-206d-bf7b4165b525.htm
---
# Autodesk.Revit.DB.LinkConversionData.ServerId Property

The service responsible for converting the data into a Revit file.

## Syntax (C#)
```csharp
public Guid ServerId { get; }
```